{"mov_rbp_rsp": 1, "sub_rsp_imm": 2, "mov_ax_di": 3, "mov_[rbp+var_2]_ax": 4, "cmp_mem_imm": 5, "jz_near_void": 6, "mov_rax_mem": 7, "mov_rdi_phrase": 8, "lea_rsi_mem": 9, "lea_rdx_[rbp+var_2]": 10, "mov_al_imm": 11, "call__fscanf_void": 12, "mov_[rbp+var_8]_eax": 13, "movsx_eax_[rbp+var_2]": 14, "add_rsp_imm": 15, "pop_rbp_void": 16, "retn_void_void": 17, "": 18, "mov_[rbp+var_8]_rdi": 19, "mov_rdi_imm": 20, "mov_rax_[rbp+var_8]": 21, "mov_[rbp+var_4]_edi": 22, "call__rand_void": 23, "and_eax_imm": 24, "cmp_eax_imm": 25, "shl_eax_imm": 26, "mov_ecx_[rbp+var_8]": 27, "xor_ecx_eax": 28, "mov_[rbp+var_c]_ecx": 29, "mov_ecx_[rbp+var_c]": 30, "mov_[rbp+var_10]_ecx": 31, "jmp_near_void": 32, "mov_eax_[rbp+var_10]": 33, "mov_[rbp+var_4]_eax": 34, "mov_eax_[rbp+var_4]": 35, "push_rbp_void": 36, "mov_rax_phrase": 37, "mov_[rbp+var_8]_rax": 38, "lea_rax_mem": 39, "mov_[rbp+var_30]_rax": 40, "mov_[rbp+var_22]_imm": 41, "mov_[rbp+var_38]_imm": 42, "mov_edi_imm": 43, "mov_esi_imm": 44, "mov_edx_imm": 45, "call__socket_void": 46, "mov_[rbp+var_38]_eax": 47, "cmp_[rbp+var_38]_imm": 48, "jnz_near_void": 49, "xor_esi_esi": 50, "mov_eax_imm": 51, "mov_edx_eax": 52, "lea_rcx_[rbp+var_18]": 53, "mov_rdi_rcx": 54, "call__memset_void": 55, "mov_[rbp+var_18.sa_family]_imm": 56, "lea_rdi_mem": 57, "call__inet_addr_void": 58, "mov_dword": 59, "ptr": 60, "[rbp+var_18.sa_data+2]_eax": 61, "mov_word": 62, "[rbp+var_18.sa_data]_imm": 63, "mov_edi_[rbp+var_38]": 64, "mov_rsi_rcx": 65, "call__connect_void": 66, "xor_ecx_ecx": 67, "lea_rsi_[rbp+var_20]": 68, "call__recv_void": 69, "mov_ecx_eax": 70, "mov_[rbp+var_34]_ecx": 71, "cmp_[rbp+var_34]_imm": 72, "lea_rdi_[rbp+var_20]": 73, "movsxd_rax_[rbp+var_34]": 74, "mov_[rbp+rax+var_20]_imm": 75, "call__atoi_void": 76, "mov_cx_ax": 77, "mov_[rbp+var_22]_cx": 78, "call__close_void": 79, "mov_[rbp+var_3c]_eax": 80, "mov_rax_[rbp+var_30]": 81, "movsx_edi_[rbp+var_22]": 82, "call_rax_void": 83, "mov_rcx_[rbp+var_8]": 84, "cmp_rax_rcx": 85, "call____stack_chk_fail_void": 86, "movsx_edi_[rbp+var_2]": 87, "call_near_void": 88, "mov_rdi_[rbp+var_8]": 89, "mov_edi_eax": 90, "mov_rcx_mem": 91, "mov_rcx_phrase": 92, "mov_[rbp+var_8]_rcx": 93, "mov_[rbp+var_78]_imm": 94, "call__malloc_void": 95, "mov_[rbp+var_78]_rax": 96, "cmp_[rbp+var_78]_imm": 97, "lea_rdi_[rbp+var_70]": 98, "mov_rcx_[rbp+var_78]": 99, "mov_phrase_imm": 100, "mov_[rbp+var_d]_imm": 101, "mov_[rbp+var_80]_imm": 102, "cmp_[rbp+var_80]_imm": 103, "jnb_near_void": 104, "mov_rax_[rbp+var_78]": 105, "mov_byte": 106, "[rax+63h]_imm": 107, "mov_rdi_[rbp+var_78]": 108, "call__printline_void": 109, "call__free_void": 110, "cmp_rax_rdi": 111, "lea_rax_[rbp+var_70]": 112, "mov_[rbp+var_e8]_rax": 113, "mov_rcx_imm": 114, "lea_rax_[rbp+var_e0]": 115, "mov_rdi_rax": 116, "mov_[rbp+var_f8]_rcx": 117, "mov_[rbp+var_100]_rax": 118, "mov_[rbp+var_7d]_imm": 119, "mov_rdi_[rbp+var_100]": 120, "call__strlen_void": 121, "mov_[rbp+var_f0]_rax": 122, "mov_rdi_[rbp+var_e8]": 123, "mov_rdx_[rbp+var_f0]": 124, "mov_rsi_[rbp+var_100]": 125, "mov_rcx_[rbp+var_f8]": 126, "call____strncat_chk_void": 127, "mov_[rbp+var_108]_rax": 128, "mov_[rbp+var_4]_imm": 129, "mov_[rbp+var_c]_eax": 130, "mov_ecx_[rbp+var_10]": 131, "mov_[rbp+var_14]_ecx": 132, "mov_eax_[rbp+var_14]": 133, "cmp_[rbp+var_4]_imm": 134, "jle_near_void": 135, "mov_edi_[rbp+var_8]": 136, "call__printintline_void": 137, "mov_[rbp+var_14]_eax": 138, "mov_ecx_[rbp+var_14]": 139, "mov_[rbp+var_18]_ecx": 140, "mov_edx_[rbp+var_18]": 141, "xor_edx_eax": 142, "sub_ecx_edx": 143, "sub_ecx_imm": 144, "lea_rax_[rbp+var_13]": 145, "mov_rdx_mem": 146, "mov_rdx_phrase": 147, "mov_[rbp+var_8]_rdx": 148, "mov_[rbp+var_20]_rdx": 149, "mov_qword": 150, "[rbp+var_13]_rdx": 151, "mov_si_mem": 152, "mov_[rbp+var_b]_si": 153, "mov_dil_mem": 154, "mov_[rbp+var_9]_dil": 155, "mov_rdi_[rbp+var_20]": 156, "mov_[rbp+var_28]_rdi": 157, "mov_[rbp+var_30]_rcx": 158, "mov_[rbp+var_38]_rax": 159, "add_rax_imm": 160, "shl_rax_imm": 161, "mov_rdi_[rbp+var_28]": 162, "mov_rsi_[rbp+var_38]": 163, "mov_rdx_rax": 164, "mov_rcx_[rbp+var_30]": 165, "call____memmove_chk_void": 166, "mov_[rbp+var_40]_rax": 167, "mov_[rbp+var_2c]_imm": 168, "cmp_phrase_imm": 169, "mov_[rbp+var_34]_imm": 170, "mov_[rbp+var_34]_eax": 171, "mov_edi_[rbp+var_34]": 172, "lea_rsi_[rbp+var_26]": 173, "mov_[rbp+var_30]_ecx": 174, "cmp_[rbp+var_30]_imm": 175, "mov_eax_[rbp+var_2c]": 176, "add_eax_imm": 177, "lea_rdx_[rbp+var_4]": 178, "imul_eax_[rbp+var_4]": 179, "lea_rdi_[rbp+var_26]": 180, "movsxd_rax_[rbp+var_30]": 181, "mov_[rbp+rax+var_26]_imm": 182, "mov_[rbp+var_2c]_eax": 183, "mov_[rbp+var_54]_eax": 184, "mov_[rbp+var_40]_imm": 185, "mov_[rbp+var_48]_imm": 186, "mov_[rbp+var_50]_rax": 187, "mov_rdi_[rbp+var_50]": 188, "call__fopen_void": 189, "mov_[rbp+var_48]_rax": 190, "cmp_[rbp+var_48]_imm": 191, "mov_rax_[rbp+var_40]": 192, "movsxd_rcx_[rbp+var_2c]": 193, "mov_rdi_[rbp+var_48]": 194, "call__fclose_void": 195, "mov_[rbp+var_58]_eax": 196, "cmp_[rbp+var_8]_imm": 197, "mov_[rbp+var_10]_rax": 198, "mov_rdi_[rbp+var_10]": 199, "call__printlonglongline_void": 200, "mov_[rbp+var_2c]_edi": 201, "mov_[rbp+var_40]_rcx": 202, "mov_[rbp+var_17]_imm": 203, "mov_[rbp+var_14]_imm": 204, "mov_[rbp+var_16]_imm": 205, "mov_rcx_[rbp+var_40]": 206, "call__bind_void": 207, "call__listen_void": 208, "xor_eax_eax": 209, "mov_rdx_rcx": 210, "call__accept_void": 211, "mov_[rbp+var_44]_eax": 212, "mov_[rbp+var_48]_eax": 213, "mov_rdx_[rbp+var_8]": 214, "cmp_rcx_rdx": 215, "mov_[rbp+var_4c]_eax": 216, "mov_[rbp+var_50]_rcx": 217, "mov_rcx_[rbp+var_50]": 218, "mov_eax_[rbp+var_3c]": 219, "mov_[rbp+var_40]_eax": 220, "mov_eax_[rbp+var_40]": 221, "mov_edi_[rbp+var_44]": 222, "mov_ecx_[rbp+var_44]": 223, "mov_[rbp+var_48]_ecx": 224, "mov_edx_[rbp+var_48]": 225, "mov_[rbp+var_40]_ecx": 226, "lea_rcx_[rbp+var_30]": 227, "jl_near_void": 228, "mov_edi_[rbp+rax*4+var_30]": 229, "call__helperbad_62_void": 230, "mov_[rbp+var_e2]_imm": 231, "lea_rdx_[rbp+var_e2]": 232, "mov_[rbp+var_e8]_eax": 233, "lea_r8_[rbp+var_e0]": 234, "mov_[rbp+var_f0]_rdi": 235, "mov_rdi_r8": 236, "mov_[rbp+var_f8]_rdx": 237, "mov_rdi_[rbp+var_f0]": 238, "mov_rdx_[rbp+var_f8]": 239, "movsx_eax_[rbp+var_e2]": 240, "jge_near_void": 241, "lea_rsi_[rbp+var_70]": 242, "lea_rdi_[rbp+var_e0]": 243, "movsx_rdx_[rbp+var_e2]": 244, "movsx_rcx_[rbp+var_e2]": 245, "mov_[rbp+rcx+var_e0]_imm": 246, "mov_rdi_mem": 247, "cmp_rdi_rax": 248, "mov_rax_rsp": 249, "mov_rsp_rax": 250, "mov_rax_[rbp+var_10]": 251, "mov_[rbp+var_18]_rax": 252, "mov_rdi_[rbp+var_18]": 253, "mov_rsp_rbp": 254, "mov_[rbp+var_2]_imm": 255, "call__globalreturnstrue_void": 256, "mov_[rbp+var_4]_cx": 257, "movsx_edi_[rbp+var_4]": 258, "lea_rdx_[rbp+var_40]": 259, "mov_r8_mem": 260, "mov_r8_phrase": 261, "mov_[rbp+var_8]_r8": 262, "mov_[rbp+var_48]_rdi": 263, "mov_rdi_[rdi+10h]": 264, "mov_[rbp+var_50]_rdi": 265, "mov_rdi_rdx": 266, "mov_[rbp+var_58]_rdx": 267, "mov_[rbp+var_60]_rcx": 268, "mov_rsi_[rbp+var_50]": 269, "mov_[rbp+var_68]_rsi": 270, "mov_rdi_[rbp+var_58]": 271, "mov_rsi_[rbp+var_68]": 272, "mov_rcx_[rbp+var_60]": 273, "call____memcpy_chk_void": 274, "mov_[rbp+var_f]_imm": 275, "mov_[rbp+var_70]_rax": 276, "mov_rdx_[rbp+var_60]": 277, "call____strcpy_chk_void": 278, "mov_[rbp+var_68]_rax": 279, "mov_[rbp+var_1]_imm": 280, "lea_rdx_[rbp+var_1]": 281, "movsx_ecx_[rbp+var_1]": 282, "add_ecx_imm": 283, "mov_r8b_cl": 284, "mov_[rbp+var_2]_r8b": 285, "call__printhexcharline_void": 286, "mov_[rbp+var_20]_rcx": 287, "mov_rax_[rbp+var_20]": 288, "sub_rax_[rbp+var_10]": 289, "cmp_rax_imm": 290, "jbe_near_void": 291, "cmp_[rbp+var_18]_imm": 292, "add_rdx_[rbp+var_10]": 293, "sub_rcx_[rbp+var_10]": 294, "mov_eax_ecx": 295, "mov_rcx_[rbp+var_18]": 296, "mov_esi_eax": 297, "call__fgets_void": 298, "mov_[rbp+var_24]_eax": 299, "movsx_ecx_phrase": 300, "cmp_ecx_imm": 301, "mov_ecx_phrase": 302, "mov_[rbp+var_4]_ecx": 303, "mov_ecx_[rbp+var_4]": 304, "mov_[rbp+var_8]_ecx": 305, "mov_rsi_mem": 306, "mov_rsi_phrase": 307, "mov_[rbp+var_8]_rsi": 308, "lea_rsi_[rbp+var_140]": 309, "mov_[rbp+var_150]_rsi": 310, "mov_rdi_[rbp+var_150]": 311, "call____memset_chk_void": 312, "lea_rcx_mem": 313, "mov_rdx_[rbp+var_150]": 314, "[rdx+63h]_imm": 315, "mov_[rbp+var_158]_rax": 316, "mov_rax_[rbp+var_150]": 317, "mov_[rbp+var_148]_rax": 318, "lea_rcx_[rbp+var_d0]": 319, "mov_[rbp+var_160]_rsi": 320, "mov_r8_[rbp+var_160]": 321, "mov_[rbp+var_168]_rdx": 322, "mov_rdx_r8": 323, "mov_[rbp+var_170]_rcx": 324, "mov_[rbp+var_9]_imm": 325, "mov_rsi_[rbp+var_148]": 326, "mov_rdi_[rbp+var_170]": 327, "mov_rdx_[rbp+var_168]": 328, "lea_rdi_[rbp+var_d0]": 329, "mov_[rbp+var_178]_rax": 330, "imul_ecx_[rbp+var_4]": 331, "lea_rcx_[rbp+var_70]": 332, "mov_r8d_eax": 333, "mov_r9_mem": 334, "mov_r9_phrase": 335, "mov_[rbp+var_8]_r9": 336, "mov_[rbp+var_e8]_rdi": 337, "mov_eax_phrase": 338, "mov_[rbp+var_f4]_eax": 339, "mov_[rbp+var_100]_rdx": 340, "mov_[rbp+var_108]_rcx": 341, "mov_rdi_[rbp+var_108]": 342, "mov_rdx_[rbp+var_100]": 343, "cmp_[rbp+var_f4]_imm": 344, "movsxd_rdx_[rbp+var_f4]": 345, "movsxd_rcx_[rbp+var_f4]": 346, "mov_[rbp+var_110]_rax": 347, "mov_[rbp+var_10]_rdi": 348, "imul_eax_[rbp+var_14]": 349, "mov_[rbp+var_18]_eax": 350, "mov_edi_[rbp+var_18]": 351, "call__printunsignedline_void": 352, "mov_[rbp+var_8]_edi": 353, "mov_[rbp+var_c]_edi": 354, "mov_edi_[rbp+var_c]": 355, "add_edi_imm": 356, "mov_[rbp+var_10]_edi": 357, "mov_edi_[rbp+var_10]": 358, "call__globalreturnstrueorfalse_void": 359, "mov_[rbp+var_1c]_eax": 360, "mov_ecx_[rbp+var_1c]": 361, "mov_[rbp+var_20]_ecx": 362, "mov_edx_[rbp+var_20]": 363, "mov_eax_[rbp+var_18]": 364, "mov_[rbp+var_e8]_rsi": 365, "mov_[rbp+var_10]_rcx": 366, "mov_rax_[rax+8]": 367, "mov_mem_rax": 368, "mov_phrase_rax": 369, "mov_[rcx+8]_rax": 370, "cmp_[rbp+var_10]_imm": 371, "mov_[rbp+var_8]_imm": 372, "movsxd_rcx_[rbp+var_4]": 373, "mov_eax_[rbp+var_4c]": 374, "movsx_eax_[rbp+var_1]": 375, "mov_r8d_imm": 376, "mov_edx_r8d": 377, "mov_ecx_r8d": 378, "lea_r9_[rbp+var_e0]": 379, "mov_rdi_r9": 380, "mov_[rbp+var_fc]_eax": 381, "call__staticreturnstrue_142_void": 382, "mov_[rbp+var_78]_rdi": 383, "mov_rsi_[rbp+var_78]": 384, "mov_[rbp+var_80]_rsi": 385, "mov_rsi_[rbp+var_80]": 386, "mov_[rbp+var_88]_rsi": 387, "mov_[rbp+var_98]_rax": 388, "mov_[rbp+var_a0]_rcx": 389, "mov_rdi_[rbp+var_98]": 390, "mov_[rbp+var_90]_rax": 391, "mov_rdi_[rbp+var_88]": 392, "mov_rdx_[rbp+var_90]": 393, "mov_rsi_[rbp+var_98]": 394, "mov_rcx_[rbp+var_a0]": 395, "mov_[rbp+var_a8]_rax": 396, "add_rdi_imm": 397, "mov_[rbp+var_18]_rdi": 398, "mov_[rbp+var_10024]_imm": 399, "mov_[rbp+var_10030]_rax": 400, "cmp_[rbp+var_10030]_imm": 401, "lea_rdi_[rbp+var_10020]": 402, "mov_rdx_[rbp+var_10030]": 403, "mov_[rbp+var_10020]_imm": 404, "mov_rdi_[rbp+var_10030]": 405, "mov_[rbp+var_10034]_eax": 406, "mov_[rbp+var_10024]_eax": 407, "cmp_[rbp+var_10024]_imm": 408, "mov_[rbp+var_10040]_rcx": 409, "mov_edi_[rbp+var_10024]": 410, "mov_rcx_[rbp+var_10040]": 411, "lea_rax_[rbp+var_10020]": 412, "mov_[rbp+var_10044]_edi": 413, "mov_[rbp+var_10048]_ecx": 414, "mov_[rbp+var_10050]_rax": 415, "mov_edi_[rbp+var_10044]": 416, "mov_rsi_[rbp+var_10050]": 417, "mov_ecx_[rbp+var_10048]": 418, "call__send_void": 419, "mov_[rbp+var_10058]_rax": 420, "mov_rdx_[rbp+var_10058]": 421, "cmp_rdx_rax": 422, "mov_[rbp+var_1005c]_eax": 423, "call__calloc_void": 424, "mov_edi_phrase": 425, "setnle_al_void": 426, "xor_al_imm": 427, "and_al_imm": 428, "movzx_edi_al": 429, "movsxd_rcx_edi": 430, "cmp_rcx_imm": 431, "lea_rdx_[rbp+var_70]": 432, "mov_r8_[rbp+var_80]": 433, "mov_[rbp+var_88]_rdx": 434, "mov_[rbp+var_90]_rcx": 435, "mov_[rbp+var_98]_rsi": 436, "mov_rcx_[rbp+var_90]": 437, "mov_[rbp+var_a0]_rax": 438, "movsx_edi_phrase": 439, "call__printf_void": 440, "mov_ecx_esi": 441, "mov_edi_esi": 442, "mov_r8_[rbp+var_78]": 443, "[r8+31h]_imm": 444, "mov_[rbp+var_80]_r8": 445, "mov_[rbp+var_88]_r8": 446, "mov_[rbp+var_90]_rdi": 447, "mov_r8_[rbp+var_90]": 448, "mov_[rbp+var_98]_rdx": 449, "mov_[rbp+var_a8]_rcx": 450, "mov_rsi_[rbp+var_88]": 451, "mov_[rbp+var_b0]_rsi": 452, "mov_rsi_[rbp+var_b0]": 453, "mov_rcx_[rbp+var_a8]": 454, "mov_[rbp+var_b8]_rax": 455, "mov_rdx_imm": 456, "lea_rax_[rbp+var_120]": 457, "mov_ecx_imm": 458, "mov_esi_ecx": 459, "lea_rdi_[rbp+var_40]": 460, "mov_[rbp+var_128]_rdi": 461, "mov_rdi_[rbp+var_128]": 462, "mov_[rbp+var_130]_rsi": 463, "mov_r8_[rbp+var_130]": 464, "mov_[rbp+var_138]_rdx": 465, "mov_[rbp+var_140]_rax": 466, "mov_[rbp+var_bd]_imm": 467, "mov_rsi_[rbp+var_140]": 468, "mov_rdx_[rbp+var_138]": 469, "cmp_rax_rdx": 470, "call__staticreturnstrue_368_void": 471, "movsx_rdi_[rbp+var_2]": 472, "sub_eax_imm": 473, "movsxd_rdx_eax": 474, "mov_rcx_[rbp+var_10]": 475, "movsx_esi_[rbp+var_2]": 476, "sub_esi_imm": 477, "movsxd_rdx_esi": 478, "mov_[rbp+var_20]_rax": 479, "mov_[rbp+var_1c]_imm": 480, "lea_rcx_[rbp+var_16]": 481, "mov_[rbp+var_28]_rax": 482, "mov_rax_[rbp+var_28]": 483, "mov_rdi_[rbp+var_30]": 484, "lea_rdi_[rbp+var_16]": 485, "mov_eax_[rbp+var_1c]": 486, "mov_[rbp+var_20]_eax": 487, "mov_edi_[rbp+var_20]": 488, "mov_eax_[rdi+8]": 489, "mov_eax_[rbp+var_c]": 490, "mov_[rbp+var_10]_eax": 491, "mov_[rbp+var_80]_rdi": 492, "mov_rdi_rsi": 493, "mov_[rbp+var_90]_rdx": 494, "mov_[rbp+var_98]_rcx": 495, "mov_rdi_[rbp+var_80]": 496, "mov_rcx_[rbp+var_98]": 497, "mov_[rbp+var_20]_rdi": 498, "mov_[rbp+var_54]_imm": 499, "mov_[rbp+var_5c]_imm": 500, "mov_[rbp+var_5c]_eax": 501, "cmp_[rbp+var_5c]_imm": 502, "mov_edi_[rbp+var_5c]": 503, "mov_[rbp+var_58]_ecx": 504, "cmp_[rbp+var_58]_imm": 505, "mov_[rbp+var_64]_eax": 506, "lea_rcx_[rbp+var_50]": 507, "cmp_[rbp+var_54]_imm": 508, "movsxd_rax_[rbp+var_54]": 509, "mov_[rbp+rax*4+var_50]_imm": 510, "mov_[rbp+var_60]_imm": 511, "cmp_[rbp+var_60]_imm": 512, "mov_[rbp+var_e8]_rcx": 513, "mov_[rbp+var_f0]_rsi": 514, "mov_r8_[rbp+var_f0]": 515, "call____strcat_chk_void": 516, "mov_[rbp+var_64]_imm": 517, "lea_rcx_[rbp+var_60]": 518, "cmp_[rbp+var_64]_imm": 519, "movsxd_rax_[rbp+var_64]": 520, "mov_[rbp+rax*4+var_60]_imm": 521, "mov_[rbp+var_6c]_imm": 522, "cmp_[rbp+var_6c]_imm": 523, "mov_edi_[rbp+var_4]": 524, "lea_rdx_[rbp+var_34]": 525, "call__exit_void": 526, "call__printstructline_void": 527, "call__staticreturnstrue_204_void": 528, "mov_cl_al": 529, "mov_[rbp+var_2]_cl": 530, "movsx_ecx_[rbp+var_2]": 531, "sub_rdi_imm": 532, "call__popen_void": 533, "call__pclose_void": 534, "mov_[rbp+var_ec]_eax": 535, "mov_[rbp+var_100]_rcx": 536, "cmp_[rbp+var_ec]_imm": 537, "movsxd_rdx_[rbp+var_ec]": 538, "call____strncpy_chk_void": 539, "movsxd_rcx_[rbp+var_ec]": 540, "mov_[rbp+rax*4+var_30]_imm": 541, "mov_[rbp+var_18]_imm": 542, "mov_rax_[rbp+var_18]": 543, "call__staticreturnstrue_116_void": 544, "lea_rsi_[rbp+var_30]": 545, "mov_[rbp+var_40]_rsi": 546, "mov_[rbp+var_48]_rdx": 547, "mov_rcx_[rbp+var_38]": 548, "mov_rdx_[rbp+var_40]": 549, "mov_rsi_rdx": 550, "mov_rdx_[rbp+var_50]": 551, "mov_rcx_[rbp+var_48]": 552, "mov_[rbp+var_58]_rax": 553, "mov_al_dil": 554, "mov_[rbp+var_5]_al": 555, "movsx_edi_[rbp+var_5]": 556, "mov_[rbp+var_44]_imm": 557, "mov_[rbp+var_58]_rcx": 558, "mov_rax_[rbp+var_50]": 559, "lea_rcx_[rbp+var_40]": 560, "cmp_[rbp+var_44]_imm": 561, "movsxd_rax_[rbp+var_44]": 562, "mov_edi_[rbp+rax*4+var_40]": 563, "mov_[rbp+var_22]_ax": 564, "mov_[rbp+var_30]_imm": 565, "mov_[rbp+var_30]_eax": 566, "mov_edi_[rbp+var_30]": 567, "mov_[rbp+var_28]_ecx": 568, "cmp_[rbp+var_28]_imm": 569, "movsxd_rax_[rbp+var_28]": 570, "cmp_[rbp+var_2c]_imm": 571, "jg_near_void": 572, "mov_ax_[rbp+var_22]": 573, "mov_[rbp+var_36]_ax": 574, "mov_ax_[rbp+var_36]": 575, "cwde__void": 576, "mov_[rbp+var_38]_rdi": 577, "mov_[rbp+var_48]_rcx": 578, "mov_[rbp+var_50]_imm": 579, "cmp_[rbp+var_50]_imm": 580, "mov_rax_[rbp+var_48]": 581, "call__staticreturnstrue_170_void": 582, "mov_ecx_[rbp+var_38]": 583, "mov_[rbp+var_3c]_ecx": 584, "mov_ecx_[rbp+var_3c]": 585, "lea_rsi_[rbp+var_e0]": 586, "mov_rcx_[rbp+var_f0]": 587, "[rcx+63h]_imm": 588, "mov_[rbp+var_f8]_rax": 589, "mov_rax_[rbp+var_f0]": 590, "mov_[rbp+var_100]_rsi": 591, "mov_r8_[rbp+var_100]": 592, "mov_[rbp+var_108]_rdx": 593, "mov_rsi_[rbp+var_110]": 594, "mov_rdx_[rbp+var_108]": 595, "mov_[rbp+var_118]_rax": 596, "mov_[rbp+var_a0]_rdx": 597, "mov_[rbp+var_70]_imm": 598, "mov_[rbp+var_6f]_imm": 599, "mov_[rbp+var_6e]_imm": 600, "mov_[rbp+var_78]_rcx": 601, "mov_[rbp+var_88]_rax": 602, "mov_rax_[rbp+var_a8]": 603, "sub_rax_[rbp+var_88]": 604, "mov_edx_ecx": 605, "add_rsi_[rbp+var_88]": 606, "sub_rdx_[rbp+var_88]": 607, "mov_ecx_edx": 608, "cmp_[rbp+var_88]_imm": 609, "mov_rcx_[rbp+var_88]": 610, "sub_rcx_imm": 611, "movsx_edx_phrase": 612, "cmp_edx_imm": 613, "mov_[rbp+var_80]_rax": 614, "mov_rax_[rbp+var_80]": 615, "mov_rdi_[rbp+var_90]": 616, "cmp_[rbp+var_98]_imm": 617, "mov_[rbp+var_ac]_eax": 618, "imul_edi_[rbp+var_4]": 619, "mov_rax_imm": 620, "mov_r8_[rbp+var_88]": 621, "mov_[rbp+var_1]_cl": 622, "mov_[rbp+var_1]_al": 623, "mov_al_[rbp+var_1]": 624, "add_al_imm": 625, "mov_[rbp+var_2]_al": 626, "mov_[rbp+var_150]_rax": 627, "lea_rcx_[rbp+var_140]": 628, "mov_[rbp+var_158]_rsi": 629, "mov_r8_[rbp+var_158]": 630, "mov_[rbp+var_160]_rdx": 631, "mov_[rbp+var_168]_rcx": 632, "mov_[rbp+var_79]_imm": 633, "mov_rdi_[rbp+var_168]": 634, "mov_rdx_[rbp+var_160]": 635, "lea_rdi_[rbp+var_140]": 636, "mov_[rbp+var_170]_rax": 637, "mov_[rbp+var_e6]_imm": 638, "mov_[rbp+var_e4]_imm": 639, "cmp_[rbp+var_e4]_imm": 640, "mov_[rbp+var_f8]_rdi": 641, "mov_rdi_[rbp+var_f8]": 642, "movsx_eax_[rbp+var_e6]": 643, "movsx_rdx_[rbp+var_e6]": 644, "movsx_rcx_[rbp+var_e6]": 645, "mov_[rbp+var_50]_rsi": 646, "mov_rcx_[rbp+var_58]": 647, "mov_cl_[rbp+var_1]": 648, "add_cl_imm": 649, "imul_eax_[rbp+var_c]": 650, "lea_rax_[rbp+var_22]": 651, "mov_cx_phrase": 652, "mov_[rbp+var_3a]_cx": 653, "mov_edi_[rbp+var_48]": 654, "cmp_[rbp+var_40]_imm": 655, "movsxd_rax_[rbp+var_40]": 656, "mov_[rbp+var_3a]_imm": 657, "mov_ax_[rbp+var_3a]": 658, "mov_phrase_ax": 659, "mov_ax_phrase": 660, "mov_[rbp+var_4a]_ax": 661, "movsx_edx_[rbp+var_4a]": 662, "movsx_rdi_[rbp+var_4a]": 663, "movsx_eax_[rbp+var_4a]": 664, "movsx_esi_[rbp+var_4a]": 665, "[r8+63h]_imm": 666, "add_r8_imm": 667, "mov_[rbp+var_e8]_r8": 668, "mov_r8_[rbp+var_f8]": 669, "mov_[rbp+var_110]_rcx": 670, "test_al_al": 671, "movaps_[rbp+var_f0]_xmm7": 672, "movaps_[rbp+var_100]_xmm6": 673, "movaps_[rbp+var_110]_xmm5": 674, "movaps_[rbp+var_120]_xmm4": 675, "movaps_[rbp+var_130]_xmm3": 676, "movaps_[rbp+var_140]_xmm2": 677, "movaps_[rbp+var_150]_xmm1": 678, "movaps_[rbp+var_160]_xmm0": 679, "mov_[rbp+var_168]_rdi": 680, "mov_[rbp+var_170]_r9": 681, "mov_[rbp+var_178]_r8": 682, "mov_[rbp+var_180]_rcx": 683, "mov_[rbp+var_188]_rdx": 684, "mov_[rbp+var_190]_rsi": 685, "movaps_xmm0_[rbp+var_160]": 686, "movaps_[rbp+var_b0]_xmm0": 687, "movaps_xmm1_[rbp+var_150]": 688, "movaps_[rbp+var_a0]_xmm1": 689, "movaps_xmm2_[rbp+var_140]": 690, "movaps_[rbp+var_90]_xmm2": 691, "movaps_xmm3_[rbp+var_130]": 692, "movaps_[rbp+var_80]_xmm3": 693, "movaps_xmm4_[rbp+var_120]": 694, "movaps_[rbp+var_70]_xmm4": 695, "movaps_xmm5_[rbp+var_110]": 696, "movaps_[rbp+var_60]_xmm5": 697, "movaps_xmm6_[rbp+var_100]": 698, "movaps_[rbp+var_50]_xmm6": 699, "movaps_xmm7_[rbp+var_f0]": 700, "movaps_[rbp+var_40]_xmm7": 701, "mov_rax_[rbp+var_170]": 702, "mov_rcx_[rbp+var_178]": 703, "mov_[rbp+var_c0]_rcx": 704, "mov_rdx_[rbp+var_180]": 705, "mov_[rbp+var_c8]_rdx": 706, "mov_rsi_[rbp+var_188]": 707, "mov_[rbp+var_d0]_rsi": 708, "mov_rdi_[rbp+var_190]": 709, "mov_[rbp+var_d8]_rdi": 710, "mov_r8_[rbp+var_168]": 711, "lea_r9_[rbp+var_20]": 712, "mov_r10_mem": 713, "mov_r10_phrase": 714, "mov_[rbp+var_8]_r10": 715, "mov_[rbp+var_28]_r8": 716, "mov_r8_r9": 717, "lea_r10_[rbp+var_e0]": 718, "mov_[r8+10h]_r10": 719, "lea_r10_[rbp+arg_0]": 720, "mov_[r8+8]_r10": 721, "[r8+4]_imm": 722, "mov_rsi_r9": 723, "call__vprintf_void": 724, "lea_rcx_[rbp+var_20]": 725, "mov_rsi_[rbp+var_8]": 726, "cmp_rdx_rsi": 727, "mov_[rbp+var_194]_eax": 728, "mov_[rbp+var_1a0]_rcx": 729, "mov_rax_[rbp+var_b8]": 730, "mov_[rbp+var_9c]_imm": 731, "mov_[rbp+var_a0]_imm": 732, "mov_[rbp+var_9c]_eax": 733, "cmp_[rbp+var_9c]_imm": 734, "lea_rcx_[rbp+var_80]": 735, "mov_[rbp+var_7f]_imm": 736, "mov_[rbp+var_7c]_imm": 737, "mov_[rbp+var_7e]_imm": 738, "mov_edi_[rbp+var_9c]": 739, "mov_rcx_[rbp+var_c0]": 740, "mov_[rbp+var_a0]_eax": 741, "cmp_[rbp+var_a0]_imm": 742, "mov_edi_[rbp+var_a0]": 743, "add_rsi_[rbp+var_a8]": 744, "sub_rdx_[rbp+var_a8]": 745, "sub_rdx_imm": 746, "shl_rdx_imm": 747, "mov_[rbp+var_8c]_ecx": 748, "cmp_[rbp+var_8c]_imm": 749, "mov_rax_[rbp+var_88]": 750, "movsxd_rdx_[rbp+var_8c]": 751, "shr_rdx_imm": 752, "add_rcx_rdx": 753, "call__strchr_void": 754, "mov_rax_[rbp+var_98]": 755, "mov_[rbp+var_c4]_eax": 756, "mov_[rbp+var_c8]_eax": 757, "mov_[rbp+var_b0]_rax": 758, "cmp_[rbp+var_b0]_imm": 759, "mov_rdi_[rbp+var_b0]": 760, "mov_[rbp+var_cc]_eax": 761, "mov_[rbp+var_f8]_rsi": 762, "mov_rsi_[rbp+var_108]": 763, "mov_[rbp+var_1a8]_imm": 764, "mov_[rbp+var_1a8]_rax": 765, "cmp_[rbp+var_1a8]_imm": 766, "lea_rsi_[rbp+var_1a0]": 767, "mov_[rbp+var_1b0]_rsi": 768, "mov_[rbp+var_1b8]_rdx": 769, "mov_[rbp+var_1c0]_rcx": 770, "mov_rcx_[rbp+var_1a8]": 771, "mov_rdx_[rbp+var_1b0]": 772, "mov_rdx_[rbp+var_1c0]": 773, "mov_rcx_[rbp+var_1b8]": 774, "mov_[rbp+var_1c8]_rax": 775, "mov_rax_[rbp+var_1a8]": 776, "call__putenv_void": 777, "mov_cx_[rbp+var_2]": 778, "mov_[rbp+var_3]_r8b": 779, "movsx_edi_[rbp+var_3]": 780, "mov_[rbp+var_340]_imm": 781, "mov_[rbp+var_334]_imm": 782, "cmp_[rbp+var_334]_imm": 783, "mov_[rbp+var_348]_imm": 784, "cmp_[rbp+var_348]_imm": 785, "mov_rax_[rbp+var_348]": 786, "mov_[rbp+rax*8+var_330]_imm": 787, "mov_[rbp+rax*8+var_32c]_imm": 788, "mov_[rbp+var_348]_rax": 789, "call__usleep_void": 790, "lea_rdi_[rbp+var_11]": 791, "[rbp+var_11]_rax": 792, "mov_cl_mem": 793, "mov_[rbp+var_9]_cl": 794, "call__mktemp_void": 795, "cmp_[rbp+var_20]_imm": 796, "call__open_void": 797, "cmp_[rbp+var_24]_imm": 798, "mov_edi_[rbp+var_24]": 799, "mov_[rbp+var_28]_eax": 800, "call_rcx_void": 801, "lea_r8_mem": 802, "mov_[rbp+var_78]_r8": 803, "mov_r8_rdi": 804, "mov_[rbp+var_94]_eax": 805, "mov_edx_[rbp+var_94]": 806, "call____snprintf_chk_void": 807, "mov_[rbp+var_98]_eax": 808, "cmp_rcx_rsi": 809, "mov_edi_ecx": 810, "mov_r8_rax": 811, "mov_rax_[rbp+var_90]": 812, "mov_rdx_[rbp+var_88]": 813, "add_rsi_imm": 814, "mov_[rbp+var_98]_rdi": 815, "mov_al_[rdi+2]": 816, "mov_[rbp+var_9]_al": 817, "movsx_ecx_[rbp+var_9]": 818, "movsx_eax_[rbp+var_9]": 819, "mov_[rbp+var_a]_cl": 820, "movsx_edi_[rbp+var_a]": 821, "lea_rdi_[rbp+var_110]": 822, "xorps_xmm0_xmm0": 823, "movsd_[rbp+var_118]_xmm0": 824, "call__atof_void": 825, "movsd_xmm0_[rbp+var_118]": 826, "sqrtsd_xmm0_xmm0": 827, "cvttsd2si_edi_xmm0": 828, "mov_[rbp+var_338]_imm": 829, "cmp_[rbp+var_340]_imm": 830, "lea_rax_[rbp+var_330]": 831, "mov_[rbp+var_338]_rax": 832, "mov_rdi_[rbp+var_338]": 833, "mov_eax_mem": 834, "mov_[rbp+var_e4]_eax": 835, "movsxd_rdx_[rbp+var_e4]": 836, "movsxd_rcx_[rbp+var_e4]": 837, "mov_[rbp+var_38]_rcx": 838, "mov_rdi_[rbp+var_38]": 839, "mov_eax_[rbp+var_20]": 840, "mov_eax_[rbp+var_24]": 841, "mov_[rbp+var_25]_cl": 842, "movsx_edi_[rbp+var_25]": 843, "call__staticreturnstrue_422_void": 844, "mov_ax_[rbp+var_2]": 845, "mov_[rbp+var_3]_cl": 846, "mov_ecx_[rbp+var_20]": 847, "mov_[rbp+var_24]_ecx": 848, "mov_edx_[rbp+var_24]": 849, "mov_[rbp+var_1c]_ecx": 850, "mov_[rbp+var_20]_imm": 851, "call__staticreturnstrue_86_void": 852, "mov_rsi_[rbp+var_48]": 853, "mov_[rbp+var_10]_imm": 854, "mov_eax_[rbp+var_8]": 855, "call__staticreturnstrue_540_void": 856, "[rax+4]_imm": 857, "mov_rsi_[rbp+var_f0]": 858, "mov_rcx_[rbp+var_e8]": 859, "mov_[rbp+var_102]_imm": 860, "mov_[rbp+var_110]_imm": 861, "mov_[rbp+var_110]_eax": 862, "cmp_[rbp+var_110]_imm": 863, "mov_edi_[rbp+var_110]": 864, "mov_[rbp+var_108]_ecx": 865, "cmp_[rbp+var_108]_imm": 866, "movsxd_rax_[rbp+var_108]": 867, "mov_[rbp+var_10c]_eax": 868, "cmp_[rbp+var_10c]_imm": 869, "mov_eax_[rbp+var_10c]": 870, "mov_[rbp+var_102]_cx": 871, "mov_[rbp+var_114]_eax": 872, "lea_rdi_[rbp+var_90]": 873, "lea_r8_[rbp+var_100]": 874, "mov_[rbp+var_120]_rdi": 875, "mov_[rbp+var_128]_rdx": 876, "mov_rdi_[rbp+var_120]": 877, "mov_rdx_[rbp+var_128]": 878, "mov_[rbp+var_2d]_imm": 879, "movsx_eax_[rbp+var_102]": 880, "lea_rsi_[rbp+var_90]": 881, "lea_rdi_[rbp+var_100]": 882, "movsx_rdx_[rbp+var_102]": 883, "movsx_rcx_[rbp+var_102]": 884, "mov_[rbp+rcx+var_100]_imm": 885, "mov_[rbp+var_130]_rax": 886, "lea_rdi_[rbp+var_b0]": 887, "lea_rsi_[rbp+var_40]": 888, "mov_[rbp+var_130]_rdi": 889, "mov_[rbp+var_13c]_eax": 890, "mov_rdi_[rbp+var_130]": 891, "mov_esi_[rbp+var_13c]": 892, "mov_[rbp+var_4d]_imm": 893, "lea_rax_[rbp+var_40]": 894, "mov_[rbp+var_128]_rax": 895, "lea_rdx_[rbp+var_120]": 896, "mov_[rbp+var_148]_rsi": 897, "mov_r8_[rbp+var_148]": 898, "mov_[rbp+var_150]_rdx": 899, "mov_[rbp+var_158]_rcx": 900, "mov_rsi_[rbp+var_128]": 901, "mov_rsi_[rbp+var_160]": 902, "mov_rcx_[rbp+var_158]": 903, "lea_rdi_[rbp+var_120]": 904, "mov_[rbp+var_168]_rax": 905, "call__realloc_void": 906, "mov_rsi_[rbp+var_18]": 907, "lea_rdx_mem": 908, "call__execlp_void": 909, "mov_r8w_cx": 910, "mov_[rbp+var_6]_r8w": 911, "movsx_edi_[rbp+var_6]": 912, "call__printshortline_void": 913, "movsd_xmm1_mem": 914, "movss_[rbp+var_4]_xmm0": 915, "movss_xmm0_[rbp+var_4]": 916, "cvtss2sd_xmm0_xmm0": 917, "divsd_xmm1_xmm0": 918, "cvttsd2si_eax_xmm1": 919, "call__staticreturnstrue_221_void": 920, "imul_eax_[rbp+var_2c]": 921, "movsxd_rdi_[rbp+var_c]": 922, "shl_rdi_imm": 923, "movsxd_rcx_[rbp+var_c]": 924, "[rdi+63h]_imm": 925, "mov_[rbp+var_50]_rdx": 926, "movsxd_rcx_eax": 927, "shl_rcx_imm": 928, "xor_rdx_rcx": 929, "mov_rdx_[rbp+var_48]": 930, "xor_rdi_rdx": 931, "sub_rcx_rdi": 932, "mov_rax_[rbp+var_38]": 933, "mov_[rbp+var_3c]_imm": 934, "cmp_[rbp+var_3c]_imm": 935, "movsxd_rax_[rbp+var_3c]": 936, "mov_eax_[rbp+var_38]": 937, "add_rcx_imm": 938, "mov_rsi_[rbp+var_f8]": 939, "mov_rcx_[rbp+var_100]": 940, "mov_[rbp+var_b8]_rcx": 941, "mov_rcx_[rbp+var_b0]": 942, "mov_[rbp+var_80.sa_family]_imm": 943, "[rbp+var_80.sa_data+2]_eax": 944, "[rbp+var_80.sa_data]_imm": 945, "mov_[rbp+var_bc]_eax": 946, "call__execl_void": 947, "mov_[rbp+var_c0]_eax": 948, "lea_r8_[rbp+var_b0]": 949, "mov_r9d_eax": 950, "mov_[rbp+var_138]_rsi": 951, "mov_[rbp+var_140]_rdx": 952, "mov_rdx_r9": 953, "mov_[rbp+var_148]_rcx": 954, "mov_[rbp+var_150]_r8": 955, "mov_[rbp+var_154]_eax": 956, "mov_esi_[rbp+var_154]": 957, "mov_rcx_[rbp+var_130]": 958, "mov_[rbp+var_128]_rcx": 959, "mov_rdi_[rbp+var_140]": 960, "mov_rcx_[rbp+var_148]": 961, "and_rax_imm": 962, "mov_rdi_rsp": 963, "sub_rdi_rax": 964, "mov_rsp_rdi": 965, "mov_[rbp+var_30]_rdi": 966, "call__wcscpy_void": 967, "cmp_rax_rsi": 968, "mov_[rbp+var_18]_rcx": 969, "mov_rdx_[rbp+var_18]": 970, "mov_rdx_[rbp+var_20]": 971, "mov_[rbp+var_28]_rdx": 972, "mov_rdx_[rbp+var_28]": 973, "mov_[rbp+var_30]_rdx": 974, "mov_rdx_[rbp+var_30]": 975, "mov_[rbp+var_38]_rdx": 976, "mov_rsi_[rbp+var_20]": 977, "add_rsi_[rbp+var_40]": 978, "sub_rdx_[rbp+var_40]": 979, "movsxd_rdx_[rbp+var_24]": 980, "mov_[rbp+var_50]_eax": 981, "mov_rax_[rbp+var_a0]": 982, "cmp_[rbp+var_90]_imm": 983, "mov_rdx_[rbp+var_78]": 984, "add_rdx_[rbp+var_88]": 985, "sub_rcx_[rbp+var_88]": 986, "mov_[rbp+var_a4]_eax": 987, "mov_[rbp+var_6]_cx": 988, "cmp_[rbp+var_c]_imm": 989, "call__puts_void": 990, "call__staticreturnstrue_5_void": 991, "lea_rdx_[rbp+var_10]": 992, "call__sscanf_void": 993, "mov_[rbp+var_c]_imm": 994, "cmp_eax_[rbp+var_10]": 995, "mov_edi_[rbp+var_14]": 996, "movsd_xmm0_mem": 997, "movss_xmm1_[rbp+var_4]": 998, "cvtss2sd_xmm1_xmm1": 999, "divsd_xmm0_xmm1": 1000, "cvttsd2si_eax_xmm0": 1001, "lea_rax_[rbp+var_2]": 1002, "mov_[rbp+var_1a]_cx": 1003, "mov_[rbp+var_1a]_imm": 1004, "mov_cx_[rbp+var_1a]": 1005, "mov_phrase_cx": 1006, "mov_[rbp+var_1c]_cx": 1007, "movsx_edx_[rbp+var_1c]": 1008, "movsx_eax_[rbp+var_1c]": 1009, "mov_[rbp+var_1e]_cx": 1010, "movsx_edi_[rbp+var_1e]": 1011, "lea_rdx_[rbp+var_8]": 1012, "mov_rax_rdx": 1013, "mov_[rbp+var_2]_cx": 1014, "mov_[rbp+var_28]_imm": 1015, "movsxd_rcx_[rbp+var_1c]": 1016, "mov_esi_[rbp+var_c]": 1017, "mov_ecx_[rbp+var_18]": 1018, "setnz_al_void": 1019, "movzx_ecx_al": 1020, "setz_al_void": 1021, "movzx_esi_al": 1022, "and_ecx_esi": 1023, "mov_al_phrase": 1024, "mov_al_cl": 1025, "mov_[rbp+var_a]_al": 1026, "mov_edi_[rbp+var_1c]": 1027, "[rbp+var_20]_rdi": 1028, "mov_[rbp+var_18]_rsi": 1029, "mov_rax_qword": 1030, "[rbp+var_20]": 1031, "mov_rcx_rsp": 1032, "mov_rsp_rcx": 1033, "lea_rcx_[rbp+var_10]": 1034, "mov_[rbp+var_12]_imm": 1035, "lea_rdi_[rbp+var_10]": 1036, "mov_[rbp+var_12]_cx": 1037, "mov_ax_[rbp+var_12]": 1038, "mov_[rbp+var_14]_ax": 1039, "mov_ax_[rbp+var_14]": 1040, "mov_[rbp+var_16]_ax": 1041, "movsx_ecx_[rbp+var_16]": 1042, "movsx_rdi_[rbp+var_16]": 1043, "movsx_eax_[rbp+var_16]": 1044, "mov_rcx_[rbp+var_20]": 1045, "movsx_esi_[rbp+var_16]": 1046, "imul_eax_ecx": 1047, "mov_dx_ax": 1048, "mov_[rbp+var_4]_dx": 1049, "mov_[rbp+var_8]_al": 1050, "mov_al_[rbp+var_8]": 1051, "mov_rdi_[rbp+var_40]": 1052, "cmp_[rbp+var_1c]_imm": 1053, "mov_[rbp+var_a4]_imm": 1054, "mov_[rbp+var_a8]_imm": 1055, "cmp_[rbp+var_a4]_imm": 1056, "mov_edi_[rbp+var_a4]": 1057, "mov_[rbp+var_a8]_eax": 1058, "cmp_[rbp+var_a8]_imm": 1059, "mov_edi_[rbp+var_a8]": 1060, "add_rsi_[rbp+var_b0]": 1061, "sub_rdx_[rbp+var_b0]": 1062, "mov_[rbp+var_94]_ecx": 1063, "cmp_[rbp+var_94]_imm": 1064, "movsxd_rdx_[rbp+var_94]": 1065, "[rcx+31h]_imm": 1066, "cmp_rax_[rbp+var_88]": 1067, "lea_rcx_[rbp+var_b0]": 1068, "mov_[rbp+var_130]_rcx": 1069, "lea_rcx_[rbp+var_120]": 1070, "mov_[rbp+var_138]_rcx": 1071, "mov_rax_[rbp+var_130]": 1072, "mov_rax_[rbp+var_128]": 1073, "mov_[rbp+var_140]_rsi": 1074, "mov_r8_[rbp+var_140]": 1075, "mov_[rbp+var_148]_rdx": 1076, "mov_rsi_[rbp+var_150]": 1077, "mov_rdx_[rbp+var_148]": 1078, "mov_edi_[rbp+var_3c]": 1079, "call__staticreturnstrue_282_void": 1080, "mov_edi_[rbp+var_40]": 1081, "mov_edi_[rbp+var_2c]": 1082, "mov_edx_esi": 1083, "mov_r8d_esi": 1084, "mov_r9_[rbp+var_f0]": 1085, "[r9+63h]_imm": 1086, "add_r9_imm": 1087, "mov_[rbp+var_e8]_r9": 1088, "mov_rcx_[rbp+var_110]": 1089, "mov_rax_rcx": 1090, "cdq__": 1091, "idiv__[rbp+var_1c]": 1092, "xor_edx_edx": 1093, "lea_r9_mem": 1094, "mov_[rbp+var_78]_r9": 1095, "mov_[rbp+var_8c]_edx": 1096, "mov_edx_[rbp+var_8c]": 1097, "mov_rcx_[rbp+var_80]": 1098, "mov_r9_[rbp+var_98]": 1099, "mov_edx_[rbp+var_1c]": 1100, "mov_[rbp+var_10]_rsi": 1101, "mov_rsi_[rbp+var_10]": 1102, "movsx_edi_[rbp+var_1]": 1103, "lea_rdx_[rbp+var_64]": 1104, "mov_[rbp+var_68]_eax": 1105, "mov_rax_[rbp+var_b0]": 1106, "mov_rcx_[rbp+var_b8]": 1107, "call__system_void": 1108, "mov_[rbp+var_f0]_imm": 1109, "cmp_[rbp+var_f0]_imm": 1110, "mov_rax_[rbp+var_e8]": 1111, "mov_[rbp+var_5]_cl": 1112, "mov_[rbp+var_100]_rdi": 1113, "mov_[rbp+var_108]_rsi": 1114, "mov_[rbp+var_110]_rdx": 1115, "mov_[rbp+var_118]_rcx": 1116, "mov_rdx_[rbp+var_110]": 1117, "mov_rcx_[rbp+var_118]": 1118, "mov_[rbp+var_120]_rax": 1119, "[rdi+31h]_imm": 1120, "mov_ax_mem": 1121, "mov_ax_cx": 1122, "mov_[rbp+var_4]_ax": 1123, "movsxd_rdi_[rbp+var_4]": 1124, "mov_esi_[rbp+var_4]": 1125, "mov_[rbp+var_c8]_rax": 1126, "mov_rax_[rbp+var_c8]": 1127, "mov_rdi_[rbp+var_b8]": 1128, "mov_[rbp+var_c0]_rax": 1129, "cmp_[rbp+var_c0]_imm": 1130, "mov_rdi_[rbp+var_c0]": 1131, "mov_[rbp+var_d0]_eax": 1132, "lea_rax_[rbp+var_b0]": 1133, "mov_[rbp+var_138]_rax": 1134, "mov_[rbp+var_140]_rdi": 1135, "mov_[rbp+var_14c]_eax": 1136, "mov_esi_[rbp+var_14c]": 1137, "mov_rdi_[rbp+var_158]": 1138, "mov_[rbp+var_130]_imm": 1139, "cmp_rax_[rbp+var_138]": 1140, "mov_rsi_[rbp+var_e8]": 1141, "mov_rdi_[rbp+var_110]": 1142, "call__memcpy_void": 1143, "imul_rcx_": 1144, "mov_esi_edx": 1145, "shr_rcx_imm": 1146, "add_edi_esi": 1147, "mov_ecx_edi": 1148, "lea_esi_phrase": 1149, "sub_eax_esi": 1150, "test_eax_eax": 1151, "cmp_edi_imm": 1152, "mov_ecx_[rbp+var_30]": 1153, "mov_edx_[rbp+var_34]": 1154, "mov_[rbp+var_2c]_ecx": 1155, "call__staticreturnstrue_583_void": 1156, "call__putchar_void": 1157, "mov_[rbp+var_10]_rdx": 1158, "mov_rdx_[rbp+var_10]": 1159, "mov_[rbp+var_18]_rdx": 1160, "call__fprintf_void": 1161, "call__staticreturnstrue_161_void": 1162, "mov_r8d_ecx": 1163, "mov_[rbp+var_15c]_ecx": 1164, "mov_esi_[rbp+var_15c]": 1165, "mov_rax_[rbp+var_148]": 1166, "mov_[rbp+var_58]_rdi": 1167, "mov_[rbp+var_60]_rdx": 1168, "mov_[rbp+var_68]_rcx": 1169, "mov_rsi_[rbp+var_58]": 1170, "mov_rdi_[rbp+var_60]": 1171, "mov_rdx_[rbp+var_68]": 1172, "mov_[rbp+var_34]_edi": 1173, "mov_ecx_[rbp+var_40]": 1174, "mov_[rbp+var_44]_ecx": 1175, "mov_eax_[rbp+var_44]": 1176, "mov_dl_cl": 1177, "mov_[rbp+var_3]_dl": 1178, "lea_rsi_[rbp+var_b0]": 1179, "lea_rsi_[rbp+var_120]": 1180, "mov_rdi_[rbp+var_138]": 1181, "mov_r8_[rbp+var_138]": 1182, "mov_[rbp+var_128]_r8": 1183, "mov_r8_[rbp+var_128]": 1184, "mov_[rbp+var_130]_r8": 1185, "mov_[rbp+var_148]_r8": 1186, "mov_[rbp+var_158]_rdi": 1187, "mov_rdi_[rbp+var_160]": 1188, "mov_[rbp+var_178]_rsi": 1189, "mov_rsi_[rbp+var_178]": 1190, "mov_rcx_[rbp+var_170]": 1191, "mov_[rbp+var_180]_rax": 1192, "lea_rax_[rbp+var_20]": 1193, "mov_[rdx+10h]_rsi": 1194, "lea_rsi_[rbp+arg_0]": 1195, "mov_[rdx+8]_rsi": 1196, "[rdx+4]_imm": 1197, "mov_rsi_[rbp+var_28]": 1198, "call__vfprintf_void": 1199, "mov_eax_[rbp+var_30]": 1200, "cmp_rdi_rcx": 1201, "call__staticreturnstrue_294_void": 1202, "lea_rax_[rbp+var_8]": 1203, "movsx_edi_[rbp+var_8]": 1204, "mov_rax_[rbp+var_f8]": 1205, "lea_rax_[rbp+var_4]": 1206, "mov_ecx_[rbp+var_34]": 1207, "mov_[rbp+var_38]_ecx": 1208, "mov_edx_[rbp+var_38]": 1209, "mov_phrase_eax": 1210, "lea_rdx_[rbp+var_18]": 1211, "cmp_eax_[rbp+var_18]": 1212, "mov_[rbp+var_a]_ax": 1213, "mov_ax_[rbp+var_a]": 1214, "mov_[rbp+var_b]_cl": 1215, "movsx_edi_[rbp+var_b]": 1216, "lea_rcx_[rbp+var_1a0]": 1217, "mov_[rbp+var_1b0]_imm": 1218, "cmp_[rbp+var_1b0]_imm": 1219, "lea_rax_[rbp+var_4c0]": 1220, "mov_[rbp+var_7f0]_rax": 1221, "lea_rax_[rbp+var_7e0]": 1222, "mov_[rbp+var_7f8]_rax": 1223, "mov_rax_[rbp+var_7f8]": 1224, "mov_[rbp+var_7e8]_rax": 1225, "lea_rsi_[rbp+var_330]": 1226, "mov_[rbp+var_800]_rsi": 1227, "mov_[rbp+var_808]_rdx": 1228, "mov_[rbp+var_810]_rcx": 1229, "mov_rcx_[rbp+var_7e8]": 1230, "mov_rdx_[rbp+var_800]": 1231, "mov_rdx_[rbp+var_810]": 1232, "mov_rcx_[rbp+var_808]": 1233, "mov_[rbp+var_818]_rax": 1234, "mov_r9w_[rbp+var_e2]": 1235, "mov_[rbp+var_e4]_r9w": 1236, "mov_r9w_[rbp+var_e4]": 1237, "mov_[rbp+var_e6]_r9w": 1238, "lea_r8_[rbp+var_70]": 1239, "lea_r9_[rbp+var_e8]": 1240, "mov_[rbp+var_f0]_r9": 1241, "mov_[rbp+var_f8]_r9": 1242, "mov_[rbp+var_110]_rdi": 1243, "mov_[rbp+var_118]_rsi": 1244, "mov_r9_[rbp+var_110]": 1245, "mov_[rbp+var_120]_rdx": 1246, "mov_phrase_rcx": 1247, "mov_rdi_[rbp+var_118]": 1248, "mov_rsi_[rbp+var_118]": 1249, "mov_rdx_[rbp+var_120]": 1250, "mov_rcx_[rbp+var_128]": 1251, "mov_rcx_[rbp+var_108]": 1252, "mov_[rbp+var_40]_rdi": 1253, "call__getc_void": 1254, "lea_rdi_[rbp+var_3]": 1255, "mov_dl_al": 1256, "mov_[rbp+var_1]_dl": 1257, "mov_ax_[rdi+4]": 1258, "mov_[rbp+var_70]_rsi": 1259, "mov_rsi_[rbp+var_70]": 1260, "mov_rcx_[rbp+var_68]": 1261, "movsxd_rdx_ecx": 1262, "cmp_rdx_imm": 1263, "lea_rax_[rbp+var_1a0]": 1264, "mov_[rbp+var_1b0]_rax": 1265, "mov_[rbp+var_1b8]_imm": 1266, "cmp_[rbp+var_1b8]_imm": 1267, "mov_rax_[rbp+var_1b0]": 1268, "mov_edi_edx": 1269, "lea_rax_[rbp+var_10]": 1270, "call__remove_void": 1271, "mov_mem_rsi": 1272, "mov_phrase_rsi": 1273, "mov_[rdi+8]_rsi": 1274, "mov_[rbp+var_338]_rdi": 1275, "mov_rcx_[rbp+var_338]": 1276, "mov_[rbp+var_340]_rcx": 1277, "lea_rcx_[rbp+var_330]": 1278, "mov_rax_[rbp+var_340]": 1279, "cmp_[rbp+var_14]_imm": 1280, "movsxd_rcx_[rbp+var_14]": 1281, "mov_ecx_[rbp+var_48]": 1282, "mov_[rbp+var_4c]_ecx": 1283, "mov_edx_[rbp+var_4c]": 1284, "call__staticreturnstrue_580_void": 1285, "mov_[rbp+var_88]_rcx": 1286, "mov_[rbp+var_8c]_eax": 1287, "mov_rdx_[rbp+var_58]": 1288, "mov_[rbp+var_60]_rax": 1289, "lea_rdx_[rbp+var_b0]": 1290, "mov_[rbp+var_d0]_rcx": 1291, "mov_rsi_[rbp+var_b8]": 1292, "mov_rdi_[rbp+var_c8]": 1293, "mov_rdx_[rbp+var_d0]": 1294, "mov_[rbp+var_d8]_rax": 1295, "cmp_[rbp+var_338]_imm": 1296, "mov_rax_[rbp+var_338]": 1297, "mov_al_[rbp+var_9]": 1298, "call__fputs_void": 1299, "mov_[rbp+var_84]_imm": 1300, "cmp_[rbp+var_84]_imm": 1301, "mov_rsi_[rbp+var_90]": 1302, "mov_eax_[rbp+var_84]": 1303, "mov_[rbp+var_84]_eax": 1304, "mov_r9_[rbp+var_100]": 1305, "mov_[rbp+var_120]_r8": 1306, "mov_rcx_[rbp+var_120]": 1307, "mov_[rbp+var_f0]_rcx": 1308, "lea_rdx_[rbp+var_e0]": 1309, "mov_[rbp+var_110]_rsi": 1310, "mov_[rbp+var_b4]_eax": 1311, "mov_[rbp+var_b8]_eax": 1312, "lea_rdi_[rbp+var_30]": 1313, "mov_[rbp+var_b8]_rsi": 1314, "mov_[rbp+var_c0]_rdx": 1315, "mov_[rbp+var_1c]_edi": 1316, "mov_r8_rcx": 1317, "mov_[rbp+var_28]_rcx": 1318, "mov_eax_[rbp+var_34]": 1319, "mov_[rbp+var_c0]_rsi": 1320, "mov_rsi_[rbp+var_c0]": 1321, "mov_[rbp+var_c4]_esi": 1322, "mov_[rbp+var_d0]_rdx": 1323, "mov_[rbp+var_e0]_rcx": 1324, "mov_r9_[rbp+var_b8]": 1325, "mov_rdi_[rbp+var_d0]": 1326, "mov_rsi_rax": 1327, "mov_edx_[rbp+var_c4]": 1328, "mov_rcx_[rbp+var_e0]": 1329, "call__printlongline_void": 1330, "lea_rax_[rbp+var_1]": 1331, "mov_cl_phrase": 1332, "mov_[rbp+var_19]_cl": 1333, "mov_[rbp+var_19]_imm": 1334, "mov_cl_[rbp+var_19]": 1335, "mov_phrase_cl": 1336, "mov_[rbp+var_1a]_cl": 1337, "mov_cl_[rbp+var_1a]": 1338, "mov_[rbp+var_1b]_cl": 1339, "movsx_edi_[rbp+var_1b]": 1340, "mov_edi_[rbp+var_50]": 1341, "mov_edi_[rbp+var_54]": 1342, "cmp_[rbp+var_4c]_imm": 1343, "movsxd_rcx_[rbp+var_4c]": 1344, "mov_[rbp+rcx+var_40]_imm": 1345, "call__strtoul_void": 1346, "mov_[rbp+var_6c]_eax": 1347, "mov_[rbp+var_70]_eax": 1348, "mov_[rbp+var_74]_imm": 1349, "cmp_[rbp+var_74]_imm": 1350, "lea_rdx_[rbp+var_98]": 1351, "mov_[rbp+var_94]_imm": 1352, "mov_eax_[rbp+var_94]": 1353, "cmp_eax_[rbp+var_98]": 1354, "mov_eax_[rbp+var_78]": 1355, "mov_[rbp+var_78]_eax": 1356, "mov_rdi_[rbp+var_a0]": 1357, "mov_[rbp+var_90]_imm": 1358, "cmp_rax_[rbp+var_98]": 1359, "call__staticreturnstrue_439_void": 1360, "idiv__[rbp+var_2c]": 1361, "mov_r11_mem": 1362, "mov_r11_phrase": 1363, "mov_[rbp+var_8]_r11": 1364, "lea_r11_[rbp+var_e0]": 1365, "mov_[r8+10h]_r11": 1366, "lea_r11_[rbp+arg_0]": 1367, "mov_[r8+8]_r11": 1368, "call__getenv_void": 1369, "mov_[rbp+var_a0]_rdi": 1370, "mov_rsi_[rbp+var_a0]": 1371, "mov_rdi_[rbp+var_d8]": 1372, "mov_[rbp+var_e0]_rdi": 1373, "mov_r8_[rbp+var_e8]": 1374, "mov_[rbp+var_f0]_rdx": 1375, "mov_rsi_[rbp+var_e0]": 1376, "setnle_cl_void": 1377, "xor_cl_imm": 1378, "and_cl_imm": 1379, "movzx_eax_cl": 1380, "movsxd_rdi_eax": 1381, "cmp_rdi_imm": 1382, "sub_rax_[rbp+var_80]": 1383, "add_rdx_[rbp+var_80]": 1384, "sub_rcx_[rbp+var_80]": 1385, "lea_rdx_[rbp+var_90]": 1386, "mov_[rbp+var_8c]_imm": 1387, "mov_eax_[rbp+var_8c]": 1388, "cmp_eax_[rbp+var_90]": 1389, "mov_edi_[rbp+var_94]": 1390, "add_ax_imm": 1391, "mov_[rbp+var_c]_ax": 1392, "movsx_edi_[rbp+var_c]": 1393, "mov_[rbp+var_8]_ax": 1394, "mov_ax_[rbp+var_8]": 1395, "movsx_eax_[rbp+var_a]": 1396, "mov_[rbp+var_c]_cx": 1397, "lea_rax_[rbp+var_28]": 1398, "lea_rcx_[rbp+var_38]": 1399, "lea_rsi_[rbp+var_28]": 1400, "lea_rax_[rbp+var_d]": 1401, "mov_cl_[rdi+2]": 1402, "mov_cl_[rbp+var_9]": 1403, "mov_[rbp+var_c]_cl": 1404, "mov_[rbp+var_b]_imm": 1405, "mov_[rbp+var_a]_imm": 1406, "mov_[rbp+var_340]_rax": 1407, "movsx_ecx_[rbp+var_a]": 1408, "lea_rsi_[rbp+var_13]": 1409, "mov_[rbp+var_13]_rax": 1410, "mov_di_mem": 1411, "mov_[rbp+var_b]_di": 1412, "mov_r8b_mem": 1413, "mov_[rbp+var_9]_r8b": 1414, "lea_rcx_[rbp+var_8]": 1415, "mov_[rbp+var_8]_cl": 1416, "mov_cl_[rbp+var_8]": 1417, "imul_edi_[rbp+var_c]": 1418, "mov_[rbp+var_13]_cl": 1419, "movsx_edi_[rbp+var_13]": 1420, "mov_[rbp+var_a8]_rdi": 1421, "mov_rsi_[rbp+var_a8]": 1422, "mov_[rbp+var_80]_rcx": 1423, "call__fwrite_void": 1424, "mov_edx_edi": 1425, "mov_[rbp+var_e2]_ax": 1426, "movsx_ecx_[rbp+var_e2]": 1427, "call__staticreturnstrue_581_void": 1428, "mov_ecx_[rbp+var_24]": 1429, "mov_ecx_[rbp+var_28]": 1430, "mov_cx_[rbp+var_1c]": 1431, "add_cx_imm": 1432, "call__staticreturnstrue_421_void": 1433, "lea_rcx_[rbp+var_78]": 1434, "mov_r8_[rbp+var_98]": 1435, "mov_[rbp+var_90]_r8": 1436, "mov_r9_[rbp+var_80]": 1437, "mov_phrase_r8": 1438, "mov_[rbp+var_a0]_r8": 1439, "mov_r8_[rbp+var_a8]": 1440, "mov_[rbp+var_b0]_rdx": 1441, "mov_rdx_[rbp+var_b0]": 1442, "mov_ecx_[rbp+var_f4]": 1443, "mov_[rbp+var_f8]_ecx": 1444, "mov_edx_[rbp+var_f8]": 1445, "mov_[rbp+var_f0]_ecx": 1446, "mov_eax_[rbp+var_f0]": 1447, "mov_r9w_ax": 1448, "mov_[rbp+var_e2]_r9w": 1449, "mov_rdi_r10": 1450, "mov_r10w_[rdi+4]": 1451, "mov_[rbp+var_ea]_r10w": 1452, "movsx_eax_[rbp+var_ea]": 1453, "movsx_rdx_[rbp+var_ea]": 1454, "movsx_rcx_[rbp+var_ea]": 1455, "mov_r8d_edi": 1456, "mov_r9_rdx": 1457, "mov_r10w_phrase": 1458, "mov_[rbp+var_f2]_r10w": 1459, "movsx_eax_[rbp+var_f2]": 1460, "movsx_rdx_[rbp+var_f2]": 1461, "movsx_rcx_[rbp+var_f2]": 1462, "call__time_void": 1463, "call__srand_void": 1464, "call__unlink_void": 1465, "mov_ecx_[rbp+var_e8]": 1466, "mov_[rbp+var_ec]_ecx": 1467, "mov_ecx_[rbp+var_ec]": 1468, "mov_[rbp+var_e2]_cx": 1469, "mov_[rbp+var_160]_rax": 1470, "mov_[rbp+var_148]_rdi": 1471, "mov_[rbp+var_150]_imm": 1472, "cmp_rax_[rbp+var_158]": 1473, "mov_r8_[rbp+var_150]": 1474, "mov_[rbp+var_158]_rdx": 1475, "mov_[rbp+var_160]_rcx": 1476, "mov_[rbp+var_168]_rsi": 1477, "mov_rsi_[rbp+var_168]": 1478, "mov_rcx_[rbp+var_160]": 1479, "add_rsi_[rbp+var_10]": 1480, "sub_rdx_[rbp+var_10]": 1481, "mov_[rbp+var_88]_rdi": 1482, "call__staticreturnstrue_453_void": 1483, "lea_rdx_[rbp+var_110]": 1484, "lea_rdi_[rbp+var_118]": 1485, "mov_[rbp+var_10f]_imm": 1486, "mov_[rbp+var_10e]_imm": 1487, "mov_[rbp+var_10d]_imm": 1488, "mov_[rbp+var_10c]_imm": 1489, "mov_rcx_[rbp+var_150]": 1490, "mov_[rbp+var_130]_rdx": 1491, "mov_rax_[rbp+var_158]": 1492, "sub_rax_[rbp+var_138]": 1493, "cmp_[rbp+var_140]_imm": 1494, "mov_rdx_[rbp+var_130]": 1495, "add_rdx_[rbp+var_138]": 1496, "sub_rcx_[rbp+var_138]": 1497, "mov_rcx_[rbp+var_140]": 1498, "mov_rax_[rbp+var_138]": 1499, "mov_[rbp+var_15c]_eax": 1500, "mov_rdi_[rbp+var_148]": 1501, "cmp_rcx_rdi": 1502, "mov_[rbp+var_160]_eax": 1503, "mov_cl_imm": 1504, "test_cl_imm": 1505, "mov_[rbp+var_114]_imm": 1506, "mov_[rbp+var_120]_rcx": 1507, "cmp_[rbp+var_114]_imm": 1508, "mov_edi_[rbp+var_114]": 1509, "mov_[rbp+var_124]_eax": 1510, "mov_[rbp+var_128]_eax": 1511, "lea_rdi_[rbp+var_8]": 1512, "mov_edx_mem": 1513, "mov_[rbp+var_10]_edx": 1514, "movsx_edx_byte": 1515, "[rax+2]": 1516, "mov_[rbp+var_2c]_edx": 1517, "mov_rdx_[rbp+var_a0]": 1518, "call_rdx_void": 1519, "mov_[rbp+var_90]_rsi": 1520, "mov_rdx_[rbp+var_98]": 1521, "mov_[rbp+var_b0]_eax": 1522, "mov_[rbp+var_f2]_imm": 1523, "mov_rax_[rbp+var_100]": 1524, "lea_rdi_[rbp+var_80]": 1525, "lea_r8_[rbp+var_f0]": 1526, "mov_[rbp+var_118]_rdx": 1527, "mov_rdx_[rbp+var_118]": 1528, "mov_[rbp+var_1d]_imm": 1529, "lea_rsi_[rbp+var_80]": 1530, "lea_rdi_[rbp+var_f0]": 1531, "mov_[rbp+rcx+var_f0]_imm": 1532, "mov_edi_dword": 1533, "[rbp+var_20+4]": 1534, "mov_[rbp+var_a0]_rsi": 1535, "movss_[rbp+var_c]_xmm0": 1536, "imul_rdx_[rbp+var_8]": 1537, "call__staticreturnstrue_285_void": 1538, "cvtsi2ss_xmm0_eax": 1539, "[rbp+var_18]": 1540, "[rbp+var_18+4]": 1541, "mov_[rbp+var_e]_cx": 1542, "movsx_edi_[rbp+var_e]": 1543, "imul_rax_[rbp+var_8]": 1544, "mov_phrase_ecx": 1545, "mov_[rbp+var_21]_dl": 1546, "movsx_edi_[rbp+var_21]": 1547, "movsx_edi_[rbp+var_9]": 1548, "imul_edi_ecx": 1549, "call__memmove_void": 1550, "mov_edi_[rax+4]": 1551, "call__staticreturnstrue_115_void": 1552, "call__freopen_void": 1553, "mov_[rbp+var_e4]_edi": 1554, "mov_al_mem": 1555, "mov_[rbp+var_24]_imm": 1556, "mov_[rbp+var_78]_rsi": 1557, "mov_[rbp+j]_imm": 1558, "mov_[rbp+j]_rax": 1559, "mov_rdi_[rbp+j]": 1560, "call__imaxabs_void": 1561, "fild_11_[rbp+var_20]": 1562, "fld_11_mem": 1563, "fsqrt_11_void": 1564, "fucomip_11_11": 1565, "fstp_11_11": 1566, "jb_near_void": 1567, "mov_rax_[rbp+j]": 1568, "imul_rax_[rbp+j]": 1569, "add_rdx_imm": 1570, "mov_r8_[rbp+var_40]": 1571, "mov_phrase_rdi": 1572, "mov_[rbp+var_60]_rsi": 1573, "mov_[rbp+var_68]_rdx": 1574, "mov_[rbp+var_70]_rcx": 1575, "mov_rdx_[rbp+var_70]": 1576, "mov_rax_[rbp+var_58]": 1577, "movss_xmm1_dword": 1578, "[rdi+8]": 1579, "movss_[rbp+var_c]_xmm1": 1580, "movss_xmm1_[rbp+var_c]": 1581, "mov_rdi_[rbp+var_1a8]": 1582, "add_rsi_[rbp+var_80]": 1583, "sub_rdx_[rbp+var_80]": 1584, "call__rename_void": 1585, "call__abs_void": 1586, "cvttsd2si_rdx_xmm0": 1587, "call__wmemset_void": 1588, "[rdx+0c4h]_imm": 1589, "mov_rsi_[rbp+var_40]": 1590, "mov_rcx_[rbp+var_28]": 1591, "call__staticreturnstrue_678_void": 1592, "idiv__[rbp+var_40]": 1593, "mov_cx_mem": 1594, "mov_[rbp+var_b]_cx": 1595, "lea_rdi_[rbp+var_28]": 1596, "[rbp+var_20+7]_imm": 1597, "mov_[rbp+var_35]_cl": 1598, "movsx_edi_[rbp+var_35]": 1599, "movsd_[rbp+var_8]_xmm0": 1600, "movsd_xmm0_[rbp+var_8]": 1601, "call__printdoubleline_void": 1602, "movsd_xmm0_phrase": 1603, "call__staticreturnstrue_662_void": 1604, "mov_[rbp+var_38]_edi": 1605, "movsx_edx_[rbp+var_2]": 1606, "sub_edx_imm": 1607, "mov_cx_dx": 1608, "lea_rdi_[rbp+var_7]": 1609, "mov_[rbp+var_7]_imm": 1610, "mov_[rbp+var_6]_al": 1611, "mov_[rbp+var_5]_imm": 1612, "mov_[rbp+var_8]_cx": 1613, "mov_cx_[rbp+var_8]": 1614, "mov_[rbp+var_a]_cx": 1615, "movsx_edx_[rbp+var_a]": 1616, "imul_eax_edx": 1617, "lea_rdi_[rbp+var_12]": 1618, "[rbp+var_12]_rax": 1619, "call__mkstemp_void": 1620, "call__fdopen_void": 1621, "mov_rax_[rbp+var_108]": 1622, "sub_rax_[rbp+var_f0]": 1623, "cmp_[rbp+var_f8]_imm": 1624, "mov_rdx_[rbp+var_e8]": 1625, "add_rdx_[rbp+var_f0]": 1626, "sub_rcx_[rbp+var_f0]": 1627, "mov_[rbp+var_118]_rdi": 1628, "mov_[rbp+var_120]_rsi": 1629, "mov_[rbp+var_12c]_eax": 1630, "mov_rsi_[rbp+var_120]": 1631, "mov_edx_[rbp+var_12c]": 1632, "mov_[rbp+var_130]_eax": 1633, "mov_[rbp+var_6]_ax": 1634, "mov_[rbp+var_6]_cl": 1635, "lea_rdi_[rbp+var_13]": 1636, "[rbp+var_13]_rax": 1637, "mov_dl_mem": 1638, "mov_[rbp+var_9]_dl": 1639, "mov_[rbp+var_12]_ax": 1640, "movsx_edi_[rbp+var_14]": 1641, "mov_rax_[rbp+var_c0]": 1642, "mov_[rbp+var_d8]_rcx": 1643, "mov_rdx_[rbp+var_d8]": 1644, "mov_[rbp+var_e0]_rax": 1645, "mov_[rbp+var_2a]_ax": 1646, "mov_ax_[rbp+var_2a]": 1647, "call__staticreturnstrue_546_void": 1648, "idiv__[rbp+var_4]": 1649, "mov_[rbp+var_108]_imm": 1650, "mov_[rbp+var_f2]_cx": 1651, "mov_[rbp+var_11]_al": 1652, "movsx_ecx_[rbp+var_11]": 1653, "movsx_edx_[rbp+var_11]": 1654, "imul_ecx_edx": 1655, "mov_[rbp+var_12]_al": 1656, "movsx_edi_[rbp+var_12]": 1657, "mov_[rbp+var_98]_imm": 1658, "lea_rax_[rbp+var_a4]": 1659, "mov_r8d_[rbp+var_a8]": 1660, "mov_rcx_rax": 1661, "call__setsockopt_void": 1662, "mov_edi_[rbp+var_98]": 1663, "add_rsi_[rbp+var_a0]": 1664, "sub_rdx_[rbp+var_a0]": 1665, "mov_eax_edx": 1666, "mov_[rbp+var_84]_ecx": 1667, "movsxd_rax_[rbp+var_84]": 1668, "mov_[rbp+rax+var_70]_imm": 1669, "call__fputc_void": 1670, "idiv__[rbp+var_14]": 1671, "mov_[rbp+var_58]_imm": 1672, "mov_edi_[rbp+var_58]": 1673, "mov_[rbp+var_54]_ecx": 1674, "movsxd_rcx_[rbp+var_54]": 1675, "mov_[rbp+var_7c]_eax": 1676, "mov_[rbp+var_80]_eax": 1677, "cmp_[rbp+var_68]_imm": 1678, "mov_rax_[rbp+var_68]": 1679, "cmp_[rbp+var_70]_imm": 1680, "mov_rdi_[rbp+var_70]": 1681, "mov_rdx_[rbp+var_38]": 1682, "mov_[rbp+var_40]_rdx": 1683, "lea_rcx_[rbp+var_4]": 1684, "mov_edx_phrase": 1685, "mov_[rbp+var_1c]_edx": 1686, "lea_rdx_[rbp+var_1c]": 1687, "mov_r8d_[rbp+var_1c]": 1688, "mov_phrase_r8d": 1689, "mov_r8d_phrase": 1690, "mov_[rbp+var_20]_r8d": 1691, "mov_r8d_[rbp+var_20]": 1692, "sub_r8d_imm": 1693, "mov_[rbp+var_24]_r8d": 1694, "movss_[rbp+var_24]_xmm0": 1695, "cvtsd2ss_xmm0_xmm0": 1696, "movss_xmm0_[rbp+var_24]": 1697, "mov_eax_[rcx+8]": 1698, "mov_[rbp+var_b4]_imm": 1699, "cmp_[rbp+var_b4]_imm": 1700, "[rbp+var_10]": 1701, "[rbp+var_10+4]": 1702, "mov_[rbp+var_f0]_r8": 1703, "mov_[rbp+var_100]_r8": 1704, "mov_[rbp+var_108]_rdi": 1705, "call__staticreturnstrue_589_void": 1706, "idiv__ecx": 1707, "sub_eax_[rbp+var_4]": 1708, "lea_rdx_[rbp+var_20]": 1709, "cmp_eax_[rbp+var_20]": 1710, "mov_[rbp+var_4]_r8w": 1711, "sub_rax_imm": 1712, "movsxd_rcx_[rbp+var_40]": 1713, "mov_[rbp+var_2d]_cl": 1714, "movsx_edi_[rbp+var_2d]": 1715, "mov_rax_[rbp+var_7f0]": 1716, "mov_[rbp+var_800]_imm": 1717, "cmp_[rbp+var_800]_imm": 1718, "mov_rax_[rbp+var_7e8]": 1719, "mov_[rbp+var_104]_imm": 1720, "mov_rax_[rbp+var_110]": 1721, "lea_rsi_[rbp+var_100]": 1722, "call__stat$inode64_void": 1723, "mov_[rbp+var_104]_eax": 1724, "cmp_[rbp+var_104]_imm": 1725, "mov_edi_[rbp+var_104]": 1726, "call__write_void": 1727, "mov_[rbp+var_11c]_eax": 1728, "mov_[rbp+var_1a8]_rdi": 1729, "call__helperbad_92_void": 1730, "movzx_r8d_cl": 1731, "movsxd_rdx_r8d": 1732, "mov_rax_[rbp+var_118]": 1733, "lea_rsi_[rbp+var_108]": 1734, "mov_edi_[rbp+var_10c]": 1735, "mov_eax_[rbp+var_74]": 1736, "mov_[rbp+var_74]_eax": 1737, "[rdi+4]_imm": 1738, "lea_rax_[rbp+var_e2]": 1739, "mov_[rbp+var_fa]_cx": 1740, "mov_[rbp+var_100]_eax": 1741, "mov_ecx_[rbp+var_100]": 1742, "mov_[rbp+var_104]_ecx": 1743, "mov_ecx_[rbp+var_104]": 1744, "mov_eax_[rbp+var_108]": 1745, "mov_[rbp+var_fa]_r9w": 1746, "mov_r9w_[rbp+var_fa]": 1747, "mov_r10_[rbp+var_f0]": 1748, "mov_phrase_r9w": 1749, "mov_r10_[rbp+var_f8]": 1750, "mov_r9w_phrase": 1751, "mov_[rbp+var_fc]_r9w": 1752, "movsx_eax_[rbp+var_fc]": 1753, "movsx_rdx_[rbp+var_fc]": 1754, "movsx_rcx_[rbp+var_fc]": 1755, "call__staticreturnstrue_360_void": 1756, "movsx_eax_[rbp+var_22]": 1757, "movsx_rdi_[rbp+var_22]": 1758, "movsx_esi_[rbp+var_22]": 1759, "mov_rdi_[rbp+var_68]": 1760, "mov_rax_[rax+10h]": 1761, "call__staticreturnstrue_460_void": 1762, "call__strtol_void": 1763, "mov_[rbp+var_138]_rdi": 1764, "call__staticreturnstrue_521_void": 1765, "movsx_eax_byte": 1766, "[rbp+var_8+3]": 1767, "or_eax_imm": 1768, "[rbp+var_8+3]_cl": 1769, "movsxd_rax_[rbp+var_38]": 1770, 